lab5_GraphQL/app/graphql/types/mutation_type.rb

INSERT INTO "resorts" ("name", "email", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Hannila"], ["email", "anna@mail.ru"], ["description", "Cool"], ["created_at", "2022-12-15 21:14:01.005427"], ["updated_at", "2022-12-15 21:14:01.005427"]]
---
    def create_resort(name:, email:, description:)
      new_resort = Resort.create(name: name, email: email, description: description)