lab5_GraphQL/app/controllers/resorts_controller.rb

  def index
    render json: Resort.all
---
SELECT "resorts".* FROM "resorts"

  def show
    render json: Resort.find(params[:id])
---
SELECT "resorts".* FROM "resorts" WHERE "resorts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]