lab1_api_rails_pg/app/models/company.rb

UPDATE "companies" SET "updated_at" = $1 WHERE "companies"."id" = $2  [["updated_at", "2022-12-12 20:21:17.716082"], ["id", 5]]
---
  def mark_delete
    self.update(deleted: true)