lab1_api_rails_pg/app/controllers/api/v1/companies_controller.rb

  def index
    render json: { companies: Company.all }, except: [:id, :created_at, :updated_at]
---
SELECT "companies".* FROM "companies"

  def create
    @company = Company.new(company_params)
    if @company.save
---
INSERT INTO "companies" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Malta"], ["location", "Minsk"], ["created_at", "2022-12-12 19:03:39.361488"], ["updated_at", "2022-12-12 19:03:39.361488"]]

  def set_company
    if params[:company_id]
      params[:id] = params[:company_id]
    end
    @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]